import { Promethee } from "./Promethee.js";
import * as c from "./consts.js";

// ---------------------------- LAB 2

// Матриця
const MATRIX = [
  ["Альтернативи", "YouTube", "Instagram", "Linkedin", "Facebook", "TikTok"],
  ["Популярність", 10, 10, 5, 10, 5], // max
  ["Профіт", 10000, 5000, 1000, 8000, 2000], // max
  ["Вартість", -400, -100, -100, -200, -50], // min
  ["Цільова аудиторія", 5, 1, 10, 5, 1], // max
  ["Тривалість відео", 60, 20, 30, 20, 10], // max
  ["Служба підтримки", 1, 1, 1, 1, 0], // max
];

// Коєфіцієнти вагомості
const W = [
  ["Популярність", 60],
  ["Профіт", 100],
  ["Вартість", 80],
  ["Цільова аудиторія", 70],
  ["Тривалість відео", 80],
  ["Служба підтримки", 20],
];

const FUNCTIONS = [
  ["Критерій", "Функція", "Параметри"],
  ["Популярність", c.GAUSSIAN_CRITERION, 5],
  ["Профіт", c.GAUSSIAN_CRITERION, 8000],
  ["Вартість", c.LEVEL_CRITERION, 500, 100],
  ["Цільова аудиторія", c.U_SHAPE, 5, 1],
  ["Тривалість відео", c.LEVEL_CRITERION, 10, 30],
  ["Служба підтримки", c.USUAL_CRITERION],
];

// Знаходження матриць попарних порівнянь значень кожного критерію
const promethee = new Promethee(MATRIX, FUNCTIONS, W);

promethee.solve();
